In [8]:
import pandas as pd

In [11]:
print(pd.__version__)

1.2.4

In [12]:
A = pd.Series([2,3,4,5], index=['a','b', 'c', 'd'])

In [14]:
type(A.values)

numpy.ndarray

In [15]:
type(A)

pandas.core.series.Series

In [16]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
A['a']

2

In [19]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

# Pandas (Series)

In [20]:
grades_dict = {'A':4, 'B':3.5, 'C':3, 'D':2.5}
grades = pd.Series(grades_dict)

In [21]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [24]:
#marks dictionary
marks_dict = {'A':85, 'B':75, 'C':65, 'D':55}
marks = pd.Series(marks_dict)

In [25]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [26]:
marks['A']

85

In [27]:
marks[0:2]

A    85
B    75
dtype: int64

# Pandas DataFrame

- we can build a dataframe using a series object

In [28]:
D = pd.DataFrame({'Marks':marks, 'Grades':grades})

In [29]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [30]:
# we can transpose the dataframe also
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [31]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [33]:
D.values #this returns a 2d array

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [35]:
D.values[2,0]

65.0

In [36]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [37]:
#adding another column
D['Scaled Marks'] = 100*(D['Marks']/90)

In [38]:
D

   Marks  Grades  Scaled Marks
A     85     4.0     94.444444
B     75     3.5     83.333333
C     65     3.0     72.222222
D     55     2.5     61.111111

In [39]:
#deleting a column
del D['Scaled Marks']

In [40]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [41]:
G = D[D['Marks']>70]

In [43]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

# Pandas (NaN)

- sometimes called not a number or none

In [44]:
A = pd.DataFrame([{'a':1, 'b':4},{'b':-3, 'c':9}])

In [45]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [46]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

# Pandas indexing

In [52]:
A = pd.Series(['a', 'b', 'c'], index=[1,3,5])

In [53]:
A[1]

'a'

In [57]:
A[1:3] #uses implicit

3    b
5    c
dtype: object

In [58]:
A.loc[1:3] #uses explicit

1    a
3    b
dtype: object

In [59]:
A.iloc[1:3] #uses implicit

3    b
5    c
dtype: object

In [60]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [61]:
D.iloc[2,:]

Marks     65.0
Grades     3.0
Name: C, dtype: float64

In [63]:
D.iloc[::-1,:] #reversing all rows

   Marks  Grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0